david0ha/anki-reader/sdkconfig.defaults
# Shared project configuration. Per-developer settings (and anything secret)
# belong in the generated `sdkconfig`, which is gitignored.
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FREERTOS_HZ=1000

# LVGL built-in Montserrat sizes. These cover every Latin glyph on screen: the
# four headline counters (44), the header clock (28), and the small numerals in
# the activity chart (14). Korean — including every note title that arrives over
# the network — comes from the full 완성형 faces in components/vault_core/fonts/
# (see ui_fonts.h).
# ui_font_jp_56 carries every kana and both JIS X 0208 kanji levels at 56 px.
# Its bitmap table is past the 16-bit offset LVGL's compact glyph format can
# address, and lv_font_conv emits a #error rather than truncating. Must match
# LV_FONT_FMT_TXT_LARGE in sim/lv_conf.h, or the simulator and the firmware
# disagree about the layout of a struct in a generated file.
CONFIG_LV_FONT_FMT_TXT_LARGE=y

# CONFIG_LV_FONT_MONTSERRAT_12 is not set
CONFIG_LV_FONT_MONTSERRAT_14=y
# CONFIG_LV_FONT_MONTSERRAT_20 is not set
# CONFIG_LV_FONT_MONTSERRAT_28 is not set
# CONFIG_LV_FONT_MONTSERRAT_44 is not set

# The vault snapshot normally comes from a machine on the same LAN over plain
# HTTP, so no certificate is involved at all. An https:// URL still works and
# validates against IDF's default bundle; the fortune board this forked from
# carried a custom bundle for a specific weather API, which has no successor
# here and would only be a stale root to maintain.
CONFIG_MBEDTLS_DEFAULT_MEM_ALLOC=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_ESP_TLS_CLIENT_SESSION_TICKETS=y

# Task Watchdog: bump from the 5s default to 10s. Two things here legitimately
# hold a core for seconds — an ECDSA cert verify on an https:// vault URL
# (mbedtls_mpi_mul_mpi busy-polls the MPI peripheral with no interrupt path),
# and a full 648x480 e-Paper refresh. Neither is a hung task (PANIC stays off),
# so widen the window rather than mask it.
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# app_main renders the full LVGL screen (provisioning drives the setup overlay
# with Lvgl_RenderNow + epd_refresh_full on the main task) — the IDF default of
# 3584 bytes overflows there, reproducibly, right at the first Wi-Fi connect.
# 8 KB matches UiTask, which exists to run exactly the same render path.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# The Wi-Fi event task runs provisioning's scan-done handler; the IDF default
# of 2304 bytes left it one log call away from overflow even after the handler
# stopped keeping buffers on its stack. Headroom, cheap at 8 MB PSRAM.
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# Phone browsers send >512 bytes of request headers to the captive portal;
# esp_http_server's default rejects the setup form with a 431
# ("Header fields are too long") before our handler ever runs.
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048

# Seeed EE04: GPIO43/44 (default UART0 TX/RX) are the e-Paper power-enable and
# CS lines, so the console must live on USB Serial/JTAG — a UART0 console would
# clock log bytes straight into the panel control pins.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
